public class Main {
    public static void main(String[]args){

//        1. შექმენით კლასი წიგნი.
//        1.1. დაამატე სამი ატრიბუტი: სათაური, ავტორი და გვერდების რაოდენობა.
//        1.2. შექმენით კონსტრუქტორი, რათა მივანიჭოთ საწყისი მნიშვნელობები.
//        1.3. დაამატე მეთოდი displayBookInfo() რომელიც წიგნის შესახებ ყველა ინფორმაციას
//              გვეტყვის

//        2. ამ სავარჯიშოს შესასრულებლად აუცილებლად ნახეთ “Java რამდენიმე კონსტრუქტორი
//        ერთ კლასში” (მუდლზეა ატვირთული).
//        2.1. წინა სავარჯიშო უკვე გაკეთებული უნდა გქონდეთ
//        2.2. დაამატეთ წიგნის კლასში ახალი კონსტრუქტორი, რომელიც მნიშვნელობას
//        მიანიჭებს სათაურს და ავტორს, ხოლო გვერდების რაოდენობას გაუტოლებს ნულს.


//        Book book = new Book("sigma","dachi",150 );
//        book.displaybookinfo();
//
//        System.out.println();
//
//
//        Book book2 = new Book("sigma","niangi");
//        book2.displaybookinfo();




//        3. შექმენით კლასი მართკუთხედი
//        3.1. დაამატეთ ატრიბუტები, სიგრძე და სიგანე
//        3.2. დაამატეთ კონსტრუქტორი, რომელიც თავდაპირველ მნიშვნელობას მიანიჭებს
//        ატრიბუტებს (შეიძლება სიგრძე და სიგანე არ იყოს მთელი რიცხვები)
//        3.3. შექმენით მეთოდი perimeter() რომელიც გამოითვლის მართკუთხედის პერიმეტრს
//        3.4. შექმენით მეთოდი area() რომელიც გამოითვლის მართკუთხედის ფართობს
//        3.5. შექმენით მეთოდი diagonal() რომელიც გამოითვლის მართკუთხედის დიაგონალის


//        4. წინა ამოცანაში დაამატეთ ახალი მეთოდი isSquare() რომელიც გვეუბება არის თუ არა
//        მოცემული მართკუთხედი კვადრატი

//        Rectangle rectangle = new Rectangle(50,50);
//
//        rectangle.area();
//        rectangle.perimeter();
//        rectangle.diagonal();
//        rectangle.iscube();



//        5. შექმენით კლასი დრო
//        5.1. დაამატეთ ატრიბუტები: საათი, წუთი და წამი
//        5.2. შექმენით კონსტრუქტორი, რომელიც სამივე ატრიბუტს მიანიჭებს მნიშვნელობას
//        5.3. დაამატე მეთოდი, ორმელიც დროს დაბეჭდავს HH:MM:SS

//        Time time = new Time(12,55,25);
//        time.time();










    }
}